; domain
(define (domain blocks)
  (:requirements :strips :equality :disjunctive-preconditions :derived-predicates :negative-preconditions :conditional-effects :existential-preconditions :typing)

  (:types
    robot block - object
  )

  (:predicates 
    (on ?block1 - block ?block2 - block)
    (ontable ?block - block)
    (clear ?block - block)
    (KBquery_fullHands ?robot - robot)
    (holding ?robot - robot ?block - block)
  )

  (:action pick-up
    :parameters (?robot - robot ?block - block)
    :precondition (and 
      (clear ?block) 
      (ontable ?block) 
      (not (KBquery_fullHands ?robot))
    )
    :effect
      (and 
        (not (ontable ?block))
        (not (clear ?block))
        (holding ?robot ?block)
      )
  )

  (:action put-down
    :parameters (?robot - robot ?block - block)
    :precondition (holding ?robot ?block)
    :effect
      (and 
        (not (holding ?robot ?block))
        (clear ?block)
        (ontable ?block)
      )
  )

  (:action stack
    :parameters (?robot - robot ?block1 - block ?block2 - block)
    :precondition (and 
      (holding ?robot ?block1) 
      (clear ?block2)
      )
    :effect
      (and 
        (not (holding ?robot ?block1))
        (not (clear ?block2))
        (clear ?block1)
        (on ?block1 ?block2)
      )
  )

  (:action unstack
    :parameters (?robot - robot ?block1 - block ?block2 - block)
    :precondition (and 
      (on ?block1 ?block2) 
      (clear ?block1) 
      (not (KBquery_fullHands ?robot))
    )
    :effect
      (and 
        (holding ?robot ?block1)
        (clear ?block2)
        (not (clear ?block1))
        (not (on ?block2 ?block1))
      )
  )
)

; problem
(define (problem BLOCKS-7-2)
(:domain BLOCKS)
(:objects B E A C D F G - block pr2 - robot)
(:INIT (CLEAR B) (CLEAR A) (ONTABLE F) (ONTABLE D) (ON B C) (ON C G) (ON G E)
 (ON E F) (ON A D))
(:goal (AND (ON E B) (ON B F) (ON F D) (ON D A) (ON A C) (ON C G)))
)

; plan
1. (unstack pr2 b c)
   deleted: (clear b)
   added: (holding pr2 b) (clear c)
   goals met: 1 of 6
2. (unstack pr2 c g)
   deleted: (clear c)
   added: (holding pr2 c) (clear g)
   goals met: 1 of 6
3. (put-down pr2 c)
   deleted: (holding pr2 c)
   added: (clear c) (ontable c)
   goals met: 1 of 6
4. (unstack pr2 a d)
   deleted: (clear a)
   added: (holding pr2 a) (clear d)
   goals met: 1 of 6
5. (stack pr2 a c)
   deleted: (holding pr2 a) (clear c)
   added: (clear a) (on a c)
   goals met: 2 of 6
6. (pick-up pr2 d)
   deleted: (ontable d) (clear d)
   added: (holding pr2 d)
   goals met: 2 of 6
7. (stack pr2 d a)
   deleted: (holding pr2 d) (clear a)
   added: (clear d) (on d a)
   goals met: 3 of 6
8. (unstack pr2 g e)
   deleted: (clear g)
   added: (holding pr2 g) (clear e)
   goals met: 3 of 6
9. (put-down pr2 g)
   deleted: (holding pr2 g)
   added: (clear g) (ontable g)
   goals met: 3 of 6
10. (unstack pr2 e f)
   deleted: (clear e)
   added: (holding pr2 e) (clear f)
   goals met: 3 of 6
11. (stack pr2 b f)
   deleted: (holding pr2 b) (clear f)
   added: (clear b) (on b f)
   goals met: 4 of 6
12. (stack pr2 e b)
   deleted: (holding pr2 e) (clear b)
   added: (clear e) (on e b)
   goals met: 5 of 6
13. (unstack pr2 e f)
   deleted: (clear e)
   added: (holding pr2 e) (clear f)
   goals met: 5 of 6
14. (pick-up pr2 f)
   deleted: (ontable f) (clear f)
   added: (holding pr2 f)
   goals met: 5 of 6
15. (stack pr2 f d)
   deleted: (holding pr2 f) (clear d)
   added: (clear f) (on f d)
   goals met: 6 of 6
